micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_dcmipp.c
  /* Disable the parallel Interface */
  if ((hdcmipp->Instance->CMCR & DCMIPP_CMCR_INSEL) == DCMIPP_PARALLEL_MODE)
  {
    CLEAR_BIT(hdcmipp->Instance->PRCR, DCMIPP_PRCR_ENABLE);
  }
  else
  {
    CLEAR_BIT(hdcmipp->Instance->CMCR, DCMIPP_CMCR_INSEL);
  }

  /* Reset flow selection configuration register for all the available pipes */
  hdcmipp->Instance->P0FSCR = 0;
  hdcmipp->Instance->P1FSCR = 0;
  hdcmipp->Instance->P2FSCR = 0;
  /* PowerDown the D-PHY_RX lane(s) etc */
  CLEAR_REG(csi_instance->PCR);

  /* Disable the CSI */
  CLEAR_BIT(csi_instance->CR, CSI_CR_CSIEN);
#if (USE_HAL_DCMIPP_REGISTER_CALLBACKS == 1)
  if (hdcmipp->MspDeInitCallback == NULL)
  {
    hdcmipp->MspDeInitCallback = HAL_DCMIPP_MspDeInit;
  }

  /* DeInit the low level hardware */
  hdcmipp->MspDeInitCallback(hdcmipp);
#else
  /* DeInit the low level hardware */
  HAL_DCMIPP_MspDeInit(hdcmipp);
#endif /* USE_HAL_DCMIPP_REGISTER_CALLBACKS */

  /* Update error code */
  hdcmipp->ErrorCode = HAL_DCMIPP_ERROR_NONE;

  /* Initialize the DCMIPP state*/
  hdcmipp->State = HAL_DCMIPP_STATE_RESET;

  /* Reset DCMIPP Pipe state */
  for (pipe_index = 0U; pipe_index < DCMIPP_NUM_OF_PIPES; pipe_index++)
  {
    hdcmipp->PipeState[pipe_index] = HAL_DCMIPP_PIPE_STATE_RESET;
  }

  return HAL_OK;
}

/**
  * @brief  Initializes the DCMIPP MSP.
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @retval None
  */
__weak void HAL_DCMIPP_MspInit(DCMIPP_HandleTypeDef *hdcmipp)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdcmipp);

  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_DCMIPP_MspInit could be implemented in the user file
   */
}

/**
  * @brief  De-Initializes the DCMIPP MSP.
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @retval None
  */
__weak void HAL_DCMIPP_MspDeInit(DCMIPP_HandleTypeDef *hdcmipp)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdcmipp);

  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_DCMIPP_MspDeInit could be implemented in the user file
   */
}
/**
  * @}
  */

/** @defgroup DCMIPP_Configuration_Functions DCMIPP Configuration Functions
  * @brief    Configuration Functions
  * @{
  */
/**
  * @brief  Configure the DCMIPP Parallel Interface according to the user parameters.
  * @param  hdcmipp         Pointer to DCMIPP handle
  * @param  pParallelConfig pointer to DCMIPP_ParallelConfTypeDef that contains
  *                         the parallel Interface configuration information for DCMIPP.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PARALLEL_SetConfig(DCMIPP_HandleTypeDef *hdcmipp,
                                                const DCMIPP_ParallelConfTypeDef *pParallelConfig)
{
  uint32_t prcr_reg;
  uint32_t prescr_reg;

  /* Check parameters */
  if ((hdcmipp == NULL) || (pParallelConfig == NULL))
  {
    return HAL_ERROR;
  }

  /* Check function parameters */
  assert_param(IS_DCMIPP_FORMAT(pParallelConfig->Format));
  assert_param(IS_DCMIPP_VSPOLARITY(pParallelConfig->VSPolarity));
  assert_param(IS_DCMIPP_HSPOLARITY(pParallelConfig->HSPolarity));
  assert_param(IS_DCMIPP_PCKPOLARITY(pParallelConfig->PCKPolarity));
  assert_param(IS_DCMIPP_EXTENDED_DATA_MODE(pParallelConfig->ExtendedDataMode));
  assert_param(IS_DCMIPP_SYNC_MODE(pParallelConfig->SynchroMode));
  assert_param(IS_DCMIPP_SWAP_BITS(pParallelConfig->SwapBits));
  assert_param(IS_DCMIPP_SWAP_CYCLES(pParallelConfig->SwapCycles));

  /* Check DCMIPP state */
  if (hdcmipp->State != HAL_DCMIPP_STATE_INIT)
  {
    return HAL_ERROR;
  }
  else
  {
    /* Configures the Format, VS, HS, PCK polarity, ExtendedDataMode, SynchronisationMode, Swap Cycles and bits */
    prcr_reg  = ((pParallelConfig->Format)           | \
                 (pParallelConfig->VSPolarity)       | \
                 (pParallelConfig->HSPolarity)       | \
                 (pParallelConfig->PCKPolarity)      | \
                 (pParallelConfig->ExtendedDataMode) | \
                 (pParallelConfig->SynchroMode)      | \
                 (pParallelConfig->SwapCycles)       | \
                 (pParallelConfig->SwapBits));

    WRITE_REG(hdcmipp->Instance->PRCR, prcr_reg);

    if (pParallelConfig->SynchroMode == DCMIPP_SYNCHRO_EMBEDDED)
    {
      /* Set Embedded Sync codes */
      prescr_reg = (((uint32_t)pParallelConfig->SynchroCodes.FrameEndCode << DCMIPP_PRESCR_FEC_Pos)   | \
                    ((uint32_t)pParallelConfig->SynchroCodes.LineEndCode << DCMIPP_PRESCR_LEC_Pos)    | \
                    ((uint32_t)pParallelConfig->SynchroCodes.FrameStartCode << DCMIPP_PRESCR_FSC_Pos) | \
                    ((uint32_t)pParallelConfig->SynchroCodes.LineStartCode << DCMIPP_PRESCR_LSC_Pos));

      WRITE_REG(hdcmipp->Instance->PRESCR, prescr_reg);

      /* Set Embedded Sync Unmask codes : All codes are unmasked */
      WRITE_REG(hdcmipp->Instance->PRESUR, 0xFFFFFFFFU);
    }

    /* Enable the Synchronization error interrupt on parallel interface */
    __HAL_DCMIPP_ENABLE_IT(hdcmipp, DCMIPP_IT_PARALLEL_SYNC_ERROR);

    /* Enable Parallel interface */
    SET_BIT(hdcmipp->Instance->PRCR, DCMIPP_PRCR_ENABLE);

    /* Set Parallel Input Selection */
    CLEAR_BIT(hdcmipp->Instance->CMCR, DCMIPP_CMCR_INSEL);
  }

  /* Update the DCMIPP state */
  hdcmipp->State = HAL_DCMIPP_STATE_READY;

  return HAL_OK;
}

/**
  * @brief  Configure the DCMIPP Serial Interface according to the user parameters.
  * @param  hdcmipp     Pointer to DCMIPP handle
  * @param  pCSI_Config pointer to DCMIPP_CSI_ConfTypeDef that contains the Serial Interface
  *                     configuration information for DCMIPP.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_CSI_SetConfig(const DCMIPP_HandleTypeDef *hdcmipp,
                                           const DCMIPP_CSI_ConfTypeDef *pCSI_Config)
{
  CSI_TypeDef *csi_instance;
  csi_instance = CSI;

  const SNPS_FreqsTypeDef SNPS_Freqs[63] =
  {
    { 0x00U, 460U },  /* HAL_CSI_BT_80 */
    { 0x10U, 460U },  /* HAL_CSI_BT_90 */
    { 0x20U, 460U },  /* HAL_CSI_BT_100 */
    { 0x30U, 460U },  /* HAL_CSI_BT_110 */
    { 0x01U, 460U },  /* HAL_CSI_BT_120 */
    { 0x11U, 460U },  /* HAL_CSI_BT_130 */
    { 0x21U, 460U },  /* HAL_CSI_BT_140 */
    { 0x31U, 460U },  /* HAL_CSI_BT_150 */
    { 0x02U, 460U },  /* HAL_CSI_BT_160 */
    { 0x12U, 460U },  /* HAL_CSI_BT_170 */
    { 0x22U, 460U },  /* HAL_CSI_BT_180 */
    { 0x32U, 460U },  /* HAL_CSI_BT_190 */
    { 0x03U, 460U },  /* HAL_CSI_BT_205 */
    { 0x13U, 460U },  /* HAL_CSI_BT_220 */
    { 0x23U, 460U },  /* HAL_CSI_BT_235 */
    { 0x33U, 460U },  /* HAL_CSI_BT_250 */
    { 0x04U, 460U },  /* HAL_CSI_BT_275 */
    { 0x14U, 460U },  /* HAL_CSI_BT_300 */
    { 0x25U, 460U },  /* HAL_CSI_BT_325 */
    { 0x35U, 460U },  /* HAL_CSI_BT_350 */
    { 0x05U, 460U },  /* HAL_CSI_BT_400 */
    { 0x16U, 460U },  /* HAL_CSI_BT_450 */
    { 0x26U, 460U },  /* HAL_CSI_BT_500 */
    { 0x37U, 460U },  /* HAL_CSI_BT_550 */
    { 0x07U, 460U },  /* HAL_CSI_BT_600 */
    { 0x18U, 460U },  /* HAL_CSI_BT_650 */
    { 0x28U, 460U },  /* HAL_CSI_BT_700 */
    { 0x39U, 460U },  /* HAL_CSI_BT_750 */
    { 0x09U, 460U },  /* HAL_CSI_BT_800 */
    { 0x19U, 460U },  /* HAL_CSI_BT_850 */
    { 0x29U, 460U },  /* HAL_CSI_BT_900 */
    { 0x3AU, 460U },  /* HAL_CSI_BT_950 */
    { 0x0AU, 460U },  /* HAL_CSI_BT_1000 */
    { 0x1AU, 460U },  /* HAL_CSI_BT_1050 */
    { 0x2AU, 460U },  /* HAL_CSI_BT_1100 */
    { 0x3BU, 460U },  /* HAL_CSI_BT_1150 */
    { 0x0BU, 460U },  /* HAL_CSI_BT_1200 */
    { 0x1BU, 460U },  /* HAL_CSI_BT_1250 */
    { 0x2BU, 460U },  /* HAL_CSI_BT_1300 */
    { 0x3CU, 460U },  /* HAL_CSI_BT_1350 */
    { 0x0CU, 460U },  /* HAL_CSI_BT_1400 */
    { 0x1CU, 460U },  /* HAL_CSI_BT_1450 */
    { 0x2CU, 460U },  /* HAL_CSI_BT_1500 */
    { 0x3DU, 285U },  /* HAL_CSI_BT_1550 */
    { 0x0DU, 295U },  /* HAL_CSI_BT_1600 */
    { 0x1DU, 304U },  /* HAL_CSI_BT_1650 */
    { 0x2EU, 313U },  /* HAL_CSI_BT_1700 */
    { 0x3EU, 322U },  /* HAL_CSI_BT_1750 */
    { 0x0EU, 331U },  /* HAL_CSI_BT_1800 */
    { 0x1EU, 341U },  /* HAL_CSI_BT_1850 */
    { 0x2FU, 350U },  /* HAL_CSI_BT_1900 */
    { 0x3FU, 359U },  /* HAL_CSI_BT_1950 */
    { 0x0FU, 368U },  /* HAL_CSI_BT_2000 */
    { 0x40U, 377U },  /* HAL_CSI_BT_2050 */
    { 0x41U, 387U },  /* HAL_CSI_BT_2100 */
    { 0x42U, 396U },  /* HAL_CSI_BT_2150 */
    { 0x43U, 405U },  /* HAL_CSI_BT_2200 */
    { 0x44U, 414U },  /* HAL_CSI_BT_2250 */
    { 0x45U, 423U },  /* HAL_CSI_BT_2300 */
    { 0x46U, 432U },  /* HAL_CSI_BT_2350 */
    { 0x47U, 442U },  /* HAL_CSI_BT_2400 */
    { 0x48U, 451U },  /* HAL_CSI_BT_2450 */
    { 0x49U, 460U },  /* HAL_CSI_BT_2500 */
  };

  /* Check parameters */
  if ((hdcmipp == NULL) || (pCSI_Config == NULL))
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_DCMIPP_ALL_INSTANCE(hdcmipp->Instance));
  assert_param(IS_DCMIPP_NUMBER_OF_LANES(pCSI_Config->NumberOfLanes));
  assert_param(IS_DCMIPP_CSI_DATA_LANE_MAPPING(pCSI_Config->DataLaneMapping));
  assert_param(IS_DCMIPP_CSI_DATA_PHY_BITRATE(pCSI_Config->PHYBitrate));

