micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_dcmipp.c
    if (pCSI_PipeConfig->DataTypeMode != DCMIPP_DTMODE_ALL)
    {
      /* Add Data Type IDA for the selected Pipe */
      pxfscr_reg |= (uint32_t)(pCSI_PipeConfig->DataTypeIDA << DCMIPP_P0FSCR_DTIDA_Pos);
    }

    if ((pCSI_PipeConfig->DataTypeMode == DCMIPP_DTMODE_DTIDA_OR_DTIDB)
        || (pCSI_PipeConfig->DataTypeMode == DCMIPP_DTMODE_ALL_EXCEPT_DTIA_DTIB))
    {
      if (Pipe != DCMIPP_PIPE2)
      {
        /* Add Data Type IDB for the selected Pipe except Pipe2 */
        pxfscr_reg |= (uint32_t)(pCSI_PipeConfig->DataTypeIDB << DCMIPP_P0FSCR_DTIDB_Pos);
      }
    }

    if (Pipe == DCMIPP_PIPE0)
    {
      MODIFY_REG(hdcmipp->Instance->P0FSCR, DCMIPP_P0FSCR_DTMODE | DCMIPP_P0FSCR_DTIDA |
                 DCMIPP_P0FSCR_DTIDB, pxfscr_reg);
    }
    else if (Pipe == DCMIPP_PIPE1)
    {
      MODIFY_REG(hdcmipp->Instance->P1FSCR, (DCMIPP_P1FSCR_DTIDA | DCMIPP_P1FSCR_DTIDB |
                                             DCMIPP_P1FSCR_DTMODE), pxfscr_reg);
    }
    else
    {
      MODIFY_REG(hdcmipp->Instance->P2FSCR, DCMIPP_P2FSCR_DTIDA, pxfscr_reg);
    }

    /* Disable Parallel interface */
    CLEAR_BIT(hdcmipp->Instance->PRCR, DCMIPP_PRCR_ENABLE);

    /* Set CSI Input Selection  */
    SET_BIT(hdcmipp->Instance->CMCR, DCMIPP_CMCR_INSEL);
  }

  /* Update the DCMIPP state */
  hdcmipp->State = HAL_DCMIPP_STATE_READY;

  return HAL_OK;
}

/**
  * @brief  Configure the DCMIPP Virtual Channel according to the user parameters.
  * @param  hdcmipp            Pointer to DCMIPP handle
  * @param  VirtualChannel     Specifies the virtual channel, can be a value @ref DCMIPP_Virtual_Channel
  * @param  pVCFilteringConfig pointer to DCMIPP_CSI_VCFilteringConfTypeDef that contains
  *                            the Virtual Channel Filtering configuration information.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_CSI_SetVCFilteringConfig(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t VirtualChannel,
                                                      const DCMIPP_CSI_VCFilteringConfTypeDef *pVCFilteringConfig)
{
  CSI_TypeDef *csi_instance;
  csi_instance = CSI;
  uint32_t cfgr1 = 0;
  uint32_t cfgr2 = 0;
  uint32_t cfgr3 = 0;
  uint32_t cfgr4 = 0;
  uint32_t i;
  struct dt_cfg
  {
    uint32_t *reg;
    uint32_t offset;
  } DTCFG[MAX_DATATYPE_NB] =
  {
    { &cfgr1, 16 }, /* DT0 */
    { &cfgr2, 0 },  /* DT1 */
    { &cfgr2, 16 }, /* DT2 */
    { &cfgr3, 0 },  /* DT3 */
    { &cfgr3, 16 }, /* DT4 */
    { &cfgr4, 0 },  /* DT5 */
    { &cfgr4, 16 }, /* DT6 */
  };

  /* Check pointer and input values validity */
  if ((hdcmipp == NULL) || (pVCFilteringConfig == NULL))
  {
    return HAL_ERROR;
  }

  assert_param(IS_DCMIPP_CSI_DATA_TYPE_NB(pVCFilteringConfig->DataTypeNB));

  for (i = 0; i < pVCFilteringConfig->DataTypeNB; i++)
  {
    assert_param(IS_DCMIPP_CSI_DATA_TYPE_FORMAT(pVCFilteringConfig->DataTypeFormat[i]));
    assert_param(IS_DCMIPP_CSI_DATA_CLASS(pVCFilteringConfig->DataTypeClass[i]));

    *(DTCFG[i].reg) |= (((pVCFilteringConfig->DataTypeClass[i]) << (DTCFG[i].offset)) | \
                        (pVCFilteringConfig->DataTypeFormat[i] << (DTCFG[i].offset + 8U)));
    cfgr1 |= ((uint32_t)1U << (CSI_VC0CFGR1_DT0EN_Pos + i));
  }

  switch (VirtualChannel)
  {
    case DCMIPP_VIRTUAL_CHANNEL0:
    {
      WRITE_REG(csi_instance->VC0CFGR1, cfgr1);
      WRITE_REG(csi_instance->VC0CFGR2, cfgr2);
      WRITE_REG(csi_instance->VC0CFGR3, cfgr3);
      WRITE_REG(csi_instance->VC0CFGR4, cfgr4);
      break;
    }
    case DCMIPP_VIRTUAL_CHANNEL1:
    {
      WRITE_REG(csi_instance->VC1CFGR1, cfgr1);
      WRITE_REG(csi_instance->VC1CFGR2, cfgr2);
      WRITE_REG(csi_instance->VC1CFGR3, cfgr3);
      WRITE_REG(csi_instance->VC1CFGR4, cfgr4);
      break;
    }
    case DCMIPP_VIRTUAL_CHANNEL2:
    {
      WRITE_REG(csi_instance->VC2CFGR1, cfgr1);
      WRITE_REG(csi_instance->VC2CFGR2, cfgr2);
      WRITE_REG(csi_instance->VC2CFGR3, cfgr3);
      WRITE_REG(csi_instance->VC2CFGR4, cfgr4);
      break;
    }
    case DCMIPP_VIRTUAL_CHANNEL3:
    {
      WRITE_REG(csi_instance->VC3CFGR1, cfgr1);
      WRITE_REG(csi_instance->VC3CFGR2, cfgr2);
      WRITE_REG(csi_instance->VC3CFGR3, cfgr3);
      WRITE_REG(csi_instance->VC3CFGR4, cfgr4);
      break;
    }
    default:
      break;
  }

  return HAL_OK;
}

/**
  * @brief  Configure the DCMIPP Virtual Channel with the selected Data Type format.
  * @param  hdcmipp        Pointer to DCMIPP handle
  * @param  VirtualChannel Specifies the virtual channel, can be a value from @ref DCMIPP_Virtual_Channel
  * @param  DataTypeFormat Specifies the Data Type Format, can be a value from @ref DCMIPP_CSI_DataTypeFormat.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_CSI_SetVCConfig(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t VirtualChannel,
                                             uint32_t DataTypeFormat)
{
  CSI_TypeDef *csi_instance;
  csi_instance = CSI;

  assert_param(IS_DCMIPP_VCID(VirtualChannel));
  assert_param(IS_DCMIPP_CSI_DATA_TYPE_FORMAT(DataTypeFormat));

  /* Check pointer and input values validity */
  if (hdcmipp == NULL)
  {
    return HAL_ERROR;
  }

  /* Set the common format for all data type for the selected virtual channel */
  switch (VirtualChannel)
  {
    case DCMIPP_VIRTUAL_CHANNEL0:
    {
      WRITE_REG(csi_instance->VC0CFGR1, (DataTypeFormat << CSI_VC0CFGR1_CDTFT_Pos) | CSI_VC0CFGR1_ALLDT);
      break;
    }
    case DCMIPP_VIRTUAL_CHANNEL1:
    {
      WRITE_REG(csi_instance->VC1CFGR1, (DataTypeFormat << CSI_VC1CFGR1_CDTFT_Pos) | CSI_VC1CFGR1_ALLDT);
      break;
    }
    case DCMIPP_VIRTUAL_CHANNEL2:
    {
      WRITE_REG(csi_instance->VC2CFGR1, (DataTypeFormat << CSI_VC2CFGR1_CDTFT_Pos) | CSI_VC2CFGR1_ALLDT);
      break;
    }
    case DCMIPP_VIRTUAL_CHANNEL3:
    {
      WRITE_REG(csi_instance->VC3CFGR1, (DataTypeFormat << CSI_VC3CFGR1_CDTFT_Pos) | CSI_VC3CFGR1_ALLDT);
      break;
    }
    default:
      break;
  }

  return HAL_OK;
}

/**
  * @brief  Configure the pipe according to the user parameters.
  * @param  hdcmipp     Pointer to DCMIPP handle
  * @param  Pipe        Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  pPipeConfig pointer to pipe configuration structure
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_SetConfig(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                            const DCMIPP_PipeConfTypeDef *pPipeConfig)
{
  HAL_DCMIPP_PipeStateTypeDef pipe_state;

  /* Check the DCMIPP peripheral handle parameter and pPipeConfig parameter */
  if ((hdcmipp == NULL) || (pPipeConfig == NULL))
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_DCMIPP_ALL_INSTANCE(hdcmipp->Instance));
  assert_param(IS_DCMIPP_PIPE(Pipe));
  assert_param(IS_DCMIPP_FRAME_RATE(pPipeConfig->FrameRate));
  if (Pipe != DCMIPP_PIPE0)
  {
    assert_param(IS_DCMIPP_PIXEL_PACKER_FORMAT(pPipeConfig->PixelPackerFormat));
    assert_param(IS_DCMIPP_PIXEL_PIPE_PITCH(pPipeConfig->PixelPipePitch));
  }

  if ((Pipe == DCMIPP_PIPE2) && ((pPipeConfig->PixelPackerFormat) > DCMIPP_PIXEL_PACKER_FORMAT_YUV422_1))
  {
    return HAL_ERROR;
  }
  /* Get Pipe State */
  pipe_state = hdcmipp->PipeState[Pipe];

  if (hdcmipp->State == HAL_DCMIPP_STATE_READY)
  {
    if ((pipe_state == HAL_DCMIPP_PIPE_STATE_RESET) || (pipe_state == HAL_DCMIPP_PIPE_STATE_ERROR))
    {
      /* Update the DCMIPP PIPE state */
      hdcmipp->PipeState[Pipe] = HAL_DCMIPP_PIPE_STATE_BUSY;

      /* Initialize the DCMIPP Pipe registers */
      Pipe_Config(hdcmipp, Pipe, pPipeConfig);

