micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_dcmipp.c
  /* Set Virtual Channel for the selected Pipe */
  if (DCMIPP_CSI_SetVCConfig(hdcmipp, Pipe, VirtualChannel) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Set Capture Mode and Destination address for the selected pipe */
  DCMIPP_SetConfig(hdcmipp, Pipe, DstAddress, CaptureMode);

  /* Enable Capture for the selected Pipe */
  DCMIPP_EnableCapture(hdcmipp, Pipe);

  return HAL_OK;
}
/**
  * @brief  Start DCMIPP capture on the specified pipe and the specified Virtual Channel in Serial Mode
  *         with double buffering Mode Enabled
  * @param  hdcmipp        Pointer to DCMIPP handle
  * @param  Pipe           Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  VirtualChannel Virtual Channel to be started can be a value from @ref DCMIPP_Virtual_Channel
  * @param  DstAddress0    1st destination address
  * @param  DstAddress1    2nd destination address
  * @param  CaptureMode    DCMIPP capture mode for the pipe can be a value from @ref DCMIPP_Capture_Mode.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_CSI_PIPE_DoubleBufferStart(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                                        uint32_t VirtualChannel, uint32_t DstAddress0,
                                                        uint32_t DstAddress1, uint32_t CaptureMode)
{
  uint32_t mode;
  assert_param(IS_DCMIPP_PIPE(Pipe));
  assert_param(IS_DCMIPP_VCID(VirtualChannel));
  assert_param(IS_DCMIPP_CAPTURE_MODE(CaptureMode));

  /* Check pointer validity */
  if ((hdcmipp == NULL) || ((DstAddress0 & 0xFU) != 0U) || ((DstAddress1 & 0xFU) != 0U))
  {
    return HAL_ERROR;
  }

  mode = READ_BIT(hdcmipp->Instance->CMCR, DCMIPP_CMCR_INSEL);
  if ((hdcmipp->PipeState[Pipe] != HAL_DCMIPP_PIPE_STATE_READY) || (mode != DCMIPP_SERIAL_MODE))
  {
    return HAL_ERROR;
  }

  /* Set Virtual Channel for the selected Pipe */
  if (DCMIPP_CSI_SetVCConfig(hdcmipp, Pipe, VirtualChannel) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Set the Address and CaptureMode for the selected Pipe */
  DCMIPP_SetDBMConfig(hdcmipp, Pipe, DstAddress0, DstAddress1, CaptureMode);

  /* Enable Capture for the selected Pipe */
  DCMIPP_EnableCapture(hdcmipp, Pipe);

  return HAL_OK;
}
/**
  * @brief  Stop DCMIPP capture on the specified pipe and the specified Virtual Channel
  * @param  hdcmipp        Pointer to DCMIPP handle
  * @param  Pipe           Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  VirtualChannel Virtual Channel to be stopped can be a value from @ref DCMIPP_Virtual_Channel
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_CSI_PIPE_Stop(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe, uint32_t VirtualChannel)
{
  HAL_DCMIPP_PipeStateTypeDef pipe_state;
  HAL_StatusTypeDef status = HAL_OK;

  assert_param(IS_DCMIPP_PIPE(Pipe));
  assert_param(IS_DCMIPP_VCID(VirtualChannel));

  /* Check pointer validity */
  if (hdcmipp == NULL)
  {
    return HAL_ERROR;
  }

  if ((hdcmipp->Instance->CMCR & DCMIPP_CMCR_INSEL) != DCMIPP_SERIAL_MODE)
  {
    return HAL_ERROR;
  }

  pipe_state = hdcmipp->PipeState[Pipe];

  /* Check DCMIPP Pipe state */
  if (pipe_state != HAL_DCMIPP_PIPE_STATE_RESET)
  {
    if (DCMIPP_Stop(hdcmipp, Pipe) != HAL_OK)
    {
      return HAL_ERROR;
    }

    if (DCMIPP_CSI_VCStop(hdcmipp, VirtualChannel) != HAL_OK)
    {
      return HAL_ERROR;
    }

    /* Update the DCMIPP pipe State */
    hdcmipp->PipeState[Pipe] = HAL_DCMIPP_PIPE_STATE_READY;
  }
  else
  {
    status = HAL_ERROR;
  }

  return status;
}

/**
  * @brief  Start the DCMIPP capture on the specified pipe for semi-planar in Serial Mode
  * @param  hdcmipp               Pointer to DCMIPP handle
  * @param  Pipe                  Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  VirtualChannel        Virtual Channel to be started can be a value from @ref DCMIPP_Virtual_Channel
  * @param  pSemiPlanarDstAddress Pointer to the destination addresses
  * @param  CaptureMode DCMIPP capture mode for the pipe can be a value from @ref DCMIPP_Capture_Mode.
  * @note   Only DCMIPP_PIPE1 allows semi-planar buffer
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_CSI_PIPE_SemiPlanarStart(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                                      uint32_t VirtualChannel,
                                                      DCMIPP_SemiPlanarDstAddressTypeDef *pSemiPlanarDstAddress,
                                                      uint32_t CaptureMode)
{
  uint32_t mode;
  assert_param(IS_DCMIPP_PIPE(Pipe));
  assert_param(IS_DCMIPP_VCID(VirtualChannel));
  assert_param(IS_DCMIPP_CAPTURE_MODE(CaptureMode));

  /* Check pointer validity */
  if ((hdcmipp == NULL) || ((pSemiPlanarDstAddress->UVAddress & 0xFU) != 0U) || \
      ((pSemiPlanarDstAddress->YAddress & 0xFU) != 0U))
  {
    return HAL_ERROR;
  }

  if (Pipe == DCMIPP_PIPE1)
  {
    mode = READ_BIT(hdcmipp->Instance->CMCR, DCMIPP_CMCR_INSEL);
    if ((hdcmipp->PipeState[Pipe] != HAL_DCMIPP_PIPE_STATE_READY) || (mode != DCMIPP_SERIAL_MODE))
    {
      return HAL_ERROR;
    }

    /* Set Virtual Channel for the selected Pipe */
    if (DCMIPP_CSI_SetVCConfig(hdcmipp, Pipe, VirtualChannel) != HAL_OK)
    {
      return HAL_ERROR;
    }

    /* Set Capture Mode and Destination address for the selected pipe */
    DCMIPP_SetConfig(hdcmipp, Pipe, pSemiPlanarDstAddress->YAddress, CaptureMode);

    /* Set Auxiliary Destination addresses */
    /* Set the destination address */
    WRITE_REG(hdcmipp->Instance->P1PPM1AR1, pSemiPlanarDstAddress->UVAddress);

    /* Enable Capture for the selected Pipe */
    DCMIPP_EnableCapture(hdcmipp, Pipe);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}
/**
  * @brief  Start the DCMIPP capture on the specified pipe with double buffering Mode in Serial Mode
  * @param  hdcmipp                 Pointer to DCMIPP handle
  * @param  Pipe                    Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  VirtualChannel          Virtual Channel to be started can be a value from @ref DCMIPP_Virtual_Channel
  * @param  pSemiPlanarDstAddress0  Pointer to the first destination addresses
  * @param  pSemiPlanarDstAddress1  Pointer to the second destination addresses
  * @param  CaptureMode DCMIPP capture mode for the pipe can be a value from @ref DCMIPP_Capture_Mode.
  * @note   Only DCMIPP_PIPE1 allows semi-planar buffer
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_CSI_PIPE_SemiPlanarDoubleBufferStart(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                                                  uint32_t VirtualChannel,
                                                                  DCMIPP_SemiPlanarDstAddressTypeDef
                                                                  *pSemiPlanarDstAddress0,
                                                                  DCMIPP_SemiPlanarDstAddressTypeDef
                                                                  *pSemiPlanarDstAddress1, uint32_t CaptureMode)
{
  uint32_t mode;
  assert_param(IS_DCMIPP_PIPE(Pipe));
  assert_param(IS_DCMIPP_VCID(VirtualChannel));
  assert_param(IS_DCMIPP_CAPTURE_MODE(CaptureMode));

  /* Check pointer validity */
  if ((hdcmipp == NULL) || ((pSemiPlanarDstAddress0->YAddress & 0xFU)  != 0U) ||
      ((pSemiPlanarDstAddress0->UVAddress & 0xFU) != 0U) ||
      ((pSemiPlanarDstAddress1->YAddress & 0xFU)  != 0U) ||
      ((pSemiPlanarDstAddress1->UVAddress & 0xFU) != 0U))
  {
    return HAL_ERROR;
  }

  if (Pipe == DCMIPP_PIPE1)
  {
    mode = READ_BIT(hdcmipp->Instance->CMCR, DCMIPP_CMCR_INSEL);
    if ((hdcmipp->PipeState[Pipe] != HAL_DCMIPP_PIPE_STATE_READY) || (mode != DCMIPP_SERIAL_MODE))
    {
      return HAL_ERROR;
    }

