micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_dcmipp.c
  return (((READ_REG(hdcmipp->Instance->P1BPRCR)) & DCMIPP_P1BPRCR_STRENGTH) >> DCMIPP_P1BPRCR_STRENGTH_Pos);
}
/**
  * @brief  Check if ISP Bad Pixel Removal is enabled or not
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @param  Pipe     Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @retval State of bit (1 or 0).
  */
uint32_t HAL_DCMIPP_PIPE_IsEnabledISPBadPixelRemoval(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe)
{
  /* Check parameters */
  assert_param(IS_DCMIPP_ALL_INSTANCE(hdcmipp->Instance));
  assert_param(IS_DCMIPP_PIPE(Pipe));

  if (Pipe == DCMIPP_PIPE1)
  {
    return ((READ_BIT(hdcmipp->Instance->P1BPRCR, DCMIPP_P1BPRCR_ENABLE) == DCMIPP_P1BPRCR_ENABLE) ? 1U : 0U);
  }
  else
  {
    /* State Disabled */
    return 0;
  }
}
/**
  * @brief  Get the number of the corrected Bad Pixel in the last frame
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @param  Pipe     Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  pCounter pointer receiving the number of corrected bad pixels
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_GetISPRemovedBadPixelCounter(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                                               uint32_t *pCounter)
{
  /* Check handles validity */
  if ((hdcmipp == NULL) || (pCounter == NULL))
  {
    return HAL_ERROR;
  }

  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  /* Check the DCMIPP State */
  if (hdcmipp->State == HAL_DCMIPP_STATE_READY)
  {
    *pCounter = READ_REG(hdcmipp->Instance->P1BPRSR & DCMIPP_P1BPRSR_BADCNT);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}
/**
  * Region Of Interest Feature :
  *     - HAL_DCMIPP_PIPE_SetRegionOfInterestConfig() : Set the Region Of Interest configuration.
  *     - HAL_DCMIPP_PIPE_EnableRegionOfInterest()    : Enable the Region Of Interest.
  *     - HAL_DCMIPP_PIPE_DisableRegionOfInterest()   : Disable the Region Of Interest.
  */
/**
  * @brief  Configure the Region Of Interest for the specified DCMIPP pipe according to the user parameters
  * @param  hdcmipp    Pointer to DCMIPP handle
  * @param  Pipe       Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  pROIConfig pointer to a DCMIPP_RegionOfInterestConfTypeDef structure that contains
  *                    the configuration information for the ROI.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_SetRegionOfInterestConfig(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                                            const DCMIPP_RegionOfInterestConfTypeDef *pROIConfig)
{
  uint32_t region_index;
  DCMIPP_Region_TypeDef *region;
  uint32_t address;

  /* Check handles validity */
  if (hdcmipp == NULL)
  {
    return HAL_ERROR;
  }

  /* Check Parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));
  assert_param(IS_DCMIPP_ROI(pROIConfig->RegionOfInterest));
  assert_param(IS_DCMIPP_ROI_START(pROIConfig->HStart));
  assert_param(IS_DCMIPP_ROI_START(pROIConfig->VStart));
  assert_param(IS_DCMIPP_ROI_SIZE(pROIConfig->HSize));
  assert_param(IS_DCMIPP_ROI_SIZE(pROIConfig->VSize));
  assert_param(IS_DCMIPP_ROI_COLOR(pROIConfig->ColorLineBlue));
  assert_param(IS_DCMIPP_ROI_COLOR(pROIConfig->ColorLineGreen));
  assert_param(IS_DCMIPP_ROI_COLOR(pROIConfig->ColorLineRed));
  assert_param(IS_DCMIPP_ROI_LINE_WIDTH(pROIConfig->LineSizeWidth));

  region_index = pROIConfig->RegionOfInterest;

  if ((Pipe == DCMIPP_PIPE1) || (Pipe == DCMIPP_PIPE2))
  {

    if (Pipe == DCMIPP_PIPE1)
    {
      address = (uint32_t) &(hdcmipp->Instance->P1RIxCR1) + (0x8U * (region_index - 1U));

      region = (DCMIPP_Region_TypeDef *)address;

      /* Set Line Width for the selected ROI */
      MODIFY_REG(hdcmipp->Instance->P1CMRICR, 0x000003U, pROIConfig->LineSizeWidth);
    }
    else
    {
      address = (uint32_t)&hdcmipp->Instance->P2RIxCR1  + (0x8U * (region_index - 1U));

      region = (DCMIPP_Region_TypeDef *)address;

      /* Set Line Width for the selected ROI */
      MODIFY_REG(hdcmipp->Instance->P2CMRICR, 0x000003U, pROIConfig->LineSizeWidth);
    }

    /* Set Offsets Linesize and color */
    MODIFY_REG(region->PxRIxCR1, 0x3FFFFFFFU, (((uint32_t)pROIConfig->ColorLineBlue << 12U) |
                                               ((uint32_t)pROIConfig->ColorLineGreen << 14U) |
                                               ((uint32_t)pROIConfig->ColorLineRed << 28U) | \
                                               ((uint32_t)pROIConfig->VStart << 16U) | (pROIConfig->HStart)));

    /* Set window size */
    MODIFY_REG(region->PxRIxCR2, 0xFFF0FFFU, ((uint32_t)pROIConfig->VSize << 16U) | pROIConfig->HSize);

  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Enable the Region Of Interest for the specified DCMIPP pipe
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @param  Pipe     Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  Region   Specifies the region, can be a value from @ref DCMIPP_Region_Of_Interest
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_EnableRegionOfInterest(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe, uint32_t Region)
{
  /* Check handles validity */
  if (hdcmipp == NULL)
  {
    return HAL_ERROR;
  }

  /* Check Parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  if (Pipe == DCMIPP_PIPE1)
  {
    /* Enable ROI */
    MODIFY_REG(hdcmipp->Instance->P1CMRICR, 0xFF0001U, ((uint32_t)1U << (16U + (Region - 1U))));
  }
  else if (Pipe == DCMIPP_PIPE2)
  {
    /* Enable ROI */
    MODIFY_REG(hdcmipp->Instance->P2CMRICR, 0xFF0001U, ((uint32_t)1U << (16U + (Region - 1U))));
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Disable the Region Of Interest for the specified DCMIPP pipe
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @param  Pipe     Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  Region   Specifies the region, can be a value from @ref DCMIPP_Region_Of_Interest
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_DisableRegionOfInterest(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                                          uint32_t Region)
{
  /* Check handles validity */
  if (hdcmipp == NULL)
  {
    return HAL_ERROR;
  }

  /* Check Parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  if (Pipe == DCMIPP_PIPE1)
  {
    /* Disable ROI */
    hdcmipp->Instance->P1CMRICR &= ~(1U << (16U + (Region - 1U)));
  }
  else if (Pipe == DCMIPP_PIPE2)
  {
    /* Disable ROI */
    hdcmipp->Instance->P2CMRICR &= ~(1U << (16U + (Region - 1U)));
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Configure the ISP Color conversion for the selected DCMIPP Pipe according to the user parameters.
  * @param  hdcmipp                Pointer to DCMIPP handle
  * @param  Pipe                   Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  pColorConversionConfig pointer to DCMIPP_ColorConversionConfTypeDef structure that contains
  *                                color conversion information.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_SetISPColorConversionConfig(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                                              const DCMIPP_ColorConversionConfTypeDef
                                                              *pColorConversionConfig)
{
  uint32_t p1cccr_reg;
  uint16_t tmp1;
  uint16_t tmp2;

  /* Check handles validity */
  if ((hdcmipp == NULL) || (pColorConversionConfig == NULL))
  {
    return HAL_ERROR;
  }

  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));
  assert_param(IS_FUNCTIONAL_STATE(pColorConversionConfig->ClampOutputSamples));
  assert_param(IS_DCMIPP_OUTPUT_SAMPLES_TYPES(pColorConversionConfig->OutputSamplesType));
  assert_param(IS_DCMIPP_COLOR_CONVERSION_COEF(pColorConversionConfig->RR));
  assert_param(IS_DCMIPP_COLOR_CONVERSION_COEF(pColorConversionConfig->RG));
  assert_param(IS_DCMIPP_COLOR_CONVERSION_COEF(pColorConversionConfig->RB));
  assert_param(IS_DCMIPP_COLOR_CONVERSION_COEF(pColorConversionConfig->RA));
  assert_param(IS_DCMIPP_COLOR_CONVERSION_COEF(pColorConversionConfig->GR));
  assert_param(IS_DCMIPP_COLOR_CONVERSION_COEF(pColorConversionConfig->GG));
  assert_param(IS_DCMIPP_COLOR_CONVERSION_COEF(pColorConversionConfig->GB));
  assert_param(IS_DCMIPP_COLOR_CONVERSION_COEF(pColorConversionConfig->GA));
  assert_param(IS_DCMIPP_COLOR_CONVERSION_COEF(pColorConversionConfig->BR));
  assert_param(IS_DCMIPP_COLOR_CONVERSION_COEF(pColorConversionConfig->BG));
  assert_param(IS_DCMIPP_COLOR_CONVERSION_COEF(pColorConversionConfig->BB));
  assert_param(IS_DCMIPP_COLOR_CONVERSION_COEF(pColorConversionConfig->BA));

  if (Pipe == DCMIPP_PIPE1)
  {
    /* Set Clamp and Type */
    p1cccr_reg = ((uint32_t)pColorConversionConfig->ClampOutputSamples << DCMIPP_P1CCCR_CLAMP_Pos) | \
                 ((uint32_t)pColorConversionConfig->OutputSamplesType);

    MODIFY_REG(hdcmipp->Instance->P1CCCR, DCMIPP_P1CCCR_CLAMP | DCMIPP_P1CCCR_TYPE, p1cccr_reg);

    tmp1 = MATRIX_VALUE11((uint16_t)pColorConversionConfig->RR);
    tmp2 = MATRIX_VALUE11((uint16_t)pColorConversionConfig->RG);

