micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_dcmipp.c
  /* Get the memory address status */
  if (Pipe == DCMIPP_PIPE0)
  {
    /* DCMIPP Pipe0 status Memory0 address */
    return READ_REG(hdcmipp->Instance->P0STM0AR);
  }
  else if (Pipe == DCMIPP_PIPE1)
  {
    if (MemoryAddress == DCMIPP_MEMORY_ADDRESS_0)
    {
      /* DCMIPP Pipe1 status Memory0 address */
      return READ_REG(hdcmipp->Instance->P1STM0AR);
    }
    else if (MemoryAddress == DCMIPP_MEMORY_ADDRESS_1)
    {
      /* DCMIPP Pipe1 status Memory1 address */
      return READ_REG(hdcmipp->Instance->P1STM1AR);
    }
    else /* DCMIPP_MEMORY2_ADDRESS */
    {
      return READ_REG(hdcmipp->Instance->P1STM2AR);
    }
  }
  else
  {
    /* DCMIPP Pipe2 status Memory0 address */
    return READ_REG(hdcmipp->Instance->P2STM0AR);
  }
}
/**
  * @}
  */
/** @defgroup DCMIPP_Exported_Functions_Group6 Peripheral get config functions
  * @{
  */
/**
  * @brief  Retrieve the ISP decimation configuration for a specified DCMIPP pipe.
  * @param  hdcmipp      Pointer to DCMIPP handle
  * @param  Pipe         Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  pDecConfig   Pointer to a DCMIPP_DecimationConfTypeDef structure that will be
  *                      filled with the decimation configuration of the specified pipe.
  * @retval None
  */
void HAL_DCMIPP_PIPE_GetISPDecimationConfig(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                            DCMIPP_DecimationConfTypeDef *pDecConfig)
{
  uint32_t p1decr;
  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  if (Pipe == DCMIPP_PIPE1)
  {
    p1decr = READ_REG(hdcmipp->Instance->P1DECR);
    pDecConfig->HRatio = (p1decr & DCMIPP_P1DECR_HDEC);
    pDecConfig->VRatio = (p1decr & DCMIPP_P1DECR_VDEC);
  }
}

/**
  * @brief  Retrieve the ISP control statistic extraction configuration for a specified DCMIPP pipe and module.
  * @param  hdcmipp                             Pointer to DCMIPP handle
  * @param  Pipe                                Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  ModuleID                            Specifies the Module ID, can be a value from
  *                                             DCMIPP_Statistics_Extraction_Module_ID.
  * @param  pStatisticExtractionConfig   Pointer to a DCMIPP_StatisticExtractionConfTypeDef structure
  *                                             that will be filled with the statistic extraction configuration
  *                                             of the specified module.
  * @retval None
  */
void HAL_DCMIPP_PIPE_GetISPStatisticExtractionConfig(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                                     uint8_t ModuleID,
                                                     DCMIPP_StatisticExtractionConfTypeDef
                                                     *pStatisticExtractionConfig)
{
  uint32_t tmp;
  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  if (Pipe == DCMIPP_PIPE1)
  {
    switch (ModuleID)
    {
      case DCMIPP_STATEXT_MODULE1:
        tmp = READ_REG(hdcmipp->Instance->P1ST1CR);
        break;
      case DCMIPP_STATEXT_MODULE2:
        tmp = READ_REG(hdcmipp->Instance->P1ST2CR);
        break;
      default:
        /* DCMIPP_STATEXT_MODULE3 */
        tmp = READ_REG(hdcmipp->Instance->P1ST3CR);
        break;
    }

    pStatisticExtractionConfig->Bins   = ((tmp & DCMIPP_P1ST1CR_BINS));
    pStatisticExtractionConfig->Mode   = ((tmp & DCMIPP_P1ST1CR_MODE));
    pStatisticExtractionConfig->Source = ((tmp & DCMIPP_P1ST1CR_SRC));
  }
}
/**
  * @brief  Retrieve the ISP area statistic extraction configuration for a specified DCMIPP pipe.
  * @param  hdcmipp                          Pointer to DCMIPP handle
  * @param  Pipe                             Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes.
  * @param  pStatisticExtractionAreaConfig   Pointer to a DCMIPP_StatisticExtractionAreaConfTypeDef structure
  *                                          that will be filled with the area statistic extraction configuration
  *                                          of the specified pipe.
  * @retval None
  */
void HAL_DCMIPP_PIPE_GetISPAreaStatisticExtractionConfig(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                                         DCMIPP_StatisticExtractionAreaConfTypeDef
                                                         *pStatisticExtractionAreaConfig)
{
  uint32_t tmp;
  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  if (Pipe == DCMIPP_PIPE1)
  {
    tmp = READ_REG(hdcmipp->Instance->P1STSTR);
    pStatisticExtractionAreaConfig->HStart = ((tmp & DCMIPP_P1STSTR_HSTART) >> DCMIPP_P1STSTR_HSTART_Pos);
    pStatisticExtractionAreaConfig->VStart = ((tmp & DCMIPP_P1STSTR_VSTART) >> DCMIPP_P1STSTR_VSTART_Pos);

    tmp = READ_REG(hdcmipp->Instance->P1STSZR);
    pStatisticExtractionAreaConfig->VSize  = ((tmp & DCMIPP_P1STSZR_VSIZE) >> DCMIPP_P1STSZR_VSIZE_Pos);
    pStatisticExtractionAreaConfig->HSize  = ((tmp & DCMIPP_P1STSZR_HSIZE) >> DCMIPP_P1STSZR_HSIZE_Pos);
  }
}
/**
  * @brief  Retrieve the ISP control contrast configuration for a specified DCMIPP pipe.
  * @param  hdcmipp          Pointer to DCMIPP handle
  * @param  Pipe             Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  pContrastConfig  Pointer to a DCMIPP_ContrastConfTypeDef structure that will be
  *                          filled with the contrast configuration of the specified pipe.
  * @retval None
  */
void HAL_DCMIPP_PIPE_GetISPCtrlContrastConfig(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                              DCMIPP_ContrastConfTypeDef *pContrastConfig)
{
  uint32_t tmp;

  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  if (Pipe == DCMIPP_PIPE1)
  {
    tmp = READ_REG(hdcmipp->Instance->P1CTCR1);

    pContrastConfig->LUM_0    = (uint8_t)((tmp & DCMIPP_P1CTCR1_LUM0) >> DCMIPP_P1CTCR1_LUM0_Pos);

    tmp = READ_REG(hdcmipp->Instance->P1CTCR2);
    pContrastConfig->LUM_32   = (uint8_t)((tmp & DCMIPP_P1CTCR2_LUM1) >> DCMIPP_P1CTCR2_LUM1_Pos);
    pContrastConfig->LUM_64   = (uint8_t)((tmp & DCMIPP_P1CTCR2_LUM2) >> DCMIPP_P1CTCR2_LUM2_Pos);
    pContrastConfig->LUM_96   = (uint8_t)((tmp & DCMIPP_P1CTCR2_LUM3) >> DCMIPP_P1CTCR2_LUM3_Pos);
    pContrastConfig->LUM_128  = (uint8_t)((tmp & DCMIPP_P1CTCR2_LUM4) >> DCMIPP_P1CTCR2_LUM4_Pos);

    tmp = READ_REG(hdcmipp->Instance->P1CTCR3);
    pContrastConfig->LUM_160  = (uint8_t)((tmp & DCMIPP_P1CTCR3_LUM5) >> DCMIPP_P1CTCR3_LUM5_Pos);
    pContrastConfig->LUM_192  = (uint8_t)((tmp & DCMIPP_P1CTCR3_LUM6) >> DCMIPP_P1CTCR3_LUM6_Pos);
    pContrastConfig->LUM_224  = (uint8_t)((tmp & DCMIPP_P1CTCR3_LUM7) >> DCMIPP_P1CTCR3_LUM7_Pos);
    pContrastConfig->LUM_256  = (uint8_t)((tmp & DCMIPP_P1CTCR3_LUM8) >> DCMIPP_P1CTCR3_LUM8_Pos);
  }
}
/**
  * @brief  Retrieve the ISP exposure configuration for a specified DCMIPP pipe.
  * @param  hdcmipp         Pointer to DCMIPP handle
  * @param  Pipe            Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  pExposureConfig Pointer to a DCMIPP_ExposureConfTypeDef structure that will be
  *                         filled with the exposure configuration of the specified pipe.
  * @retval None
  */
void HAL_DCMIPP_PIPE_GetISPExposureConfig(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                          DCMIPP_ExposureConfTypeDef *pExposureConfig)
{
  uint32_t tmp;

  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  if (Pipe == DCMIPP_PIPE1)
  {
    tmp = READ_REG(hdcmipp->Instance->P1EXCR2);

    pExposureConfig->MultiplierBlue  = (uint8_t)((tmp & DCMIPP_P1EXCR2_MULTB) >> DCMIPP_P1EXCR2_MULTB_Pos);
    pExposureConfig->ShiftBlue       = (uint8_t)((tmp & DCMIPP_P1EXCR2_SHFB) >> DCMIPP_P1EXCR2_SHFB_Pos);
    pExposureConfig->ShiftGreen      = (uint8_t)((tmp & DCMIPP_P1EXCR2_SHFG) >> DCMIPP_P1EXCR2_SHFG_Pos);
    pExposureConfig->MultiplierGreen = (uint8_t)((tmp & DCMIPP_P1EXCR2_MULTG) >> DCMIPP_P1EXCR2_MULTG_Pos);

    tmp = READ_REG(hdcmipp->Instance->P1EXCR1);

    pExposureConfig->MultiplierRed   = (uint8_t)((tmp & DCMIPP_P1EXCR1_MULTR) >> DCMIPP_P1EXCR1_MULTR_Pos);
    pExposureConfig->ShiftRed        = (uint8_t)((tmp & DCMIPP_P1EXCR1_SHFR) >> DCMIPP_P1EXCR1_SHFR_Pos);
  }
}
/**
  * @brief  Retrieve the ISP Raw Bayer to RGB conversion configuration for a specified DCMIPP pipe.
  * @param  hdcmipp             Pointer to DCMIPP handle
  * @param  Pipe                Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  pRawBayer2RGBConfig Pointer to a DCMIPP_RawBayer2RGBConfTypeDef structure that will be
  *                             filled with the Raw Bayer to RGB conversion configuration of the specified pipe.
  * @retval None
  */
void HAL_DCMIPP_PIPE_GetISPRawBayer2RGBConfig(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                              DCMIPP_RawBayer2RGBConfTypeDef *pRawBayer2RGBConfig)
{
  uint32_t p1dmcr_reg;
  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  if (Pipe == DCMIPP_PIPE1)
  {
    p1dmcr_reg = READ_REG(hdcmipp->Instance->P1DMCR);

    pRawBayer2RGBConfig->EdgeStrength  = ((p1dmcr_reg & DCMIPP_P1DMCR_EDGE) >> DCMIPP_P1DMCR_EDGE_Pos);
    pRawBayer2RGBConfig->HLineStrength = ((p1dmcr_reg & DCMIPP_P1DMCR_LINEH) >> DCMIPP_P1DMCR_LINEH_Pos);
    pRawBayer2RGBConfig->PeakStrength  = ((p1dmcr_reg & DCMIPP_P1DMCR_PEAK) >> DCMIPP_P1DMCR_PEAK_Pos);
    pRawBayer2RGBConfig->RawBayerType  = (p1dmcr_reg & DCMIPP_P1DMCR_TYPE);
    pRawBayer2RGBConfig->VLineStrength = ((p1dmcr_reg & DCMIPP_P1DMCR_LINEV) >> DCMIPP_P1DMCR_LINEV_Pos);
  }
}
/**
  * @brief  Retrieve the ISP color conversion configuration for a specified DCMIPP pipe.
  * @param  hdcmipp                 Pointer to DCMIPP handle
  * @param  Pipe                    Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  pColorConversionConfig  Pointer to a DCMIPP_ColorConversionConfTypeDef structure that will be
  *                                 filled with the color conversion configuration of the specified pipe.
  * @retval None
  */
void HAL_DCMIPP_PIPE_GetISPColorConversionConfig(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                                 DCMIPP_ColorConversionConfTypeDef *pColorConversionConfig)
{
  uint16_t tmp;

  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  if (Pipe == DCMIPP_PIPE1)
  {
    tmp = (uint16_t)READ_REG(hdcmipp->Instance->P1CCCR);

    UNUSED(tmp);

